<!DOCTYPE html>
<html lang="es">

<head>
    <meta charset="UTF-8">
    <meta name="viewport" content="width=device-width, initial-scale=1.0">
    <title>BANKBU®</title>
    <link rel="stylesheet" href="../css/style.css">
<<<<<<< HEAD:HelpBankbu/desarrollo/templates/OPH_009B.html
    <link rel="stylesheet" href="../css/PAGES.css">
=======
    <link rel="stylesheet" href="../css/NUH_001B.css">
>>>>>>> dc9b8d58fcbf9349078fff898f472e7198432d9b:desarrollo/templates/OPH_009B.html
</head>

<body>
    <header>
        <img class="logo" src="../img/logoBankbu_.png" alt="Logo de Mi Empresa">
        <div id="menuBtn">
            <img src="../img/menu.png" alt="Botón de Menú ">
        </div>
    </header>
    <nav>
        <ul>
            <li>
                <a href="../index.html" class="main-option">INICIO</a>
            </li>
            <li><a href="#" class="main-option">NUCLEO</a>
                <ul>
                    <li><a href="NUH_000B.html">Config. Sistema</a></li>
                    <li><a href="NUH_00B_N2.html">Parametros</a></li>
                    <li><a href="NUH_00B_inicio.html">Inicio</a></li>
                    <li><a href="NUH_00B_proceso.html">Proceso</a></li>
                    <li><a href="NUH_00B_inf.html">Inf. Cliente</a></li>
                    <li><a href="NUH_00B_conta.html">Contabilidad</a></li>
                    <li><a href="NUH_00B_audi.html">Auditoria</a></li>
                    <li><a href="NUH_00B_migra.html">Migracion</a></li>
                </ul>
            </li>
            <li>
                <a href="#" class="main-option">EMISOR</a>
                <ul>
                    <li><a href="EMH_000B.html">Productos</a></li>
                    <li><a href="EMH_000Bsoli.html">Solicitudes</a></li>
                    <li><a href="EMH_000Bmerca.html">Mercadeo</a></li>
                    <li><a href="EMH_000Bservi.html">Servicio Al Cliente</a></li>
                    <li><a href="EMH_000Bpendi.html">Pendientes</a></li>
                    <li><a href="EMH_000Btrans.html">Transaccionabilidad</a></li>
                    <li><a href="EMH_000Bauto.html">Autorizaciones</a></li>
                    <li><a href="EMH_000Bplasti.html">Adm. Plasticos</a></li>
                    <li><a href="EMH_000Brecla.html">Reclamos</a></li>
                </ul>
            </li>
            <li>
                <a href="ACH_000B.html" class="main-option">ADQUIRIENTE</a>
            </li>
            <li>
                <a href="DBH_000B.html" class="main-option">TARJETA DEBITO</a>
            </li>
        </ul>
    </nav>

    <section>
        <div id="layer">
            <table width="100%" border="0">
              <tr>
                <td width="57%"><div align="right">
                  <p align="center" class="TITLE">Ejecuci&oacute;n grupos en malla</p>
                </div></td>
              </tr>
            </table>
            <p align="justify" class="PARRAFO">Esta opci&oacute;n muestra todos aquellos grupos que  hayan sido marcados como <em>Obligatorio</em> en la opci&oacute;n <a href="OPH_001B.html" class="LINK2">Definici&oacute;n grupos de procesos</a>. De acuerdo a esto, esta opci&oacute;n s&oacute;lo nos muestra los grupos de procesos a ejecutar autom&aacute;ticamente.</p>
            <p align="justify" class="PARRAFO">La pantalla principal se divide en dos partes en la cuales se encontrar&aacute;n los Grupos de procesos a la izquierda, as&iacute; como se muestra en la siguiente imagen.</p>
            <p align="justify" class="PARRAFO">Por otro lado , la opci&oacute;n cuenta tambi&eacute;n con el v&iacute;nculo de <a href="#Procesos" target="_self" class="LINK2">Procesos</a> que nos permitir&aacute; consultar el detalle de algunos de los procesos pertenecientes al grupo que por alguna raz&oacute;n hayan presentado error en su ejecuci&oacute;n. </p>
            <p align="center"><img src="../img/OPF_009E.PNG" width="493" height="467"></p>
            <p align="center">&nbsp;</p>
            <p align="left" class="PARRAFO">A la derecha de esta pantalla se ubica una ventana que funciona como log de operaciones, describiendo las acciones y resultados de cada uno de los procesos que han sido ejecutados. </p>
            <p align="center"><img src="../img/OPF_009E1.PNG" width="517" height="294"></p>
            <p align="center">&nbsp;</p>
            <p align="left" class="PARRAFO">A trav&eacute;s de esta pantalla principal el usuario debe ejecutar todos los Grupos de procesos a trav&eacute;s del bot&oacute;n <strong>Ejecutar</strong>. De esta forma el sistema tomar&aacute; todos los procesos pertenecientes a estos Grupos, ejecut&aacute;ndolos de acuerdo a la parametrizaci&oacute;n de precedentes realizada en la opci&oacute;n <a href="OPH_001B.html" class="LINK2">Definici&oacute;n grupos de procesos</a>.</p>
            <p align="left" class="PARRAFO">El sistema refrescar&aacute; la pantalla junto con el log de operaciones de acuerdo a los rangos de tiempo definidos en la parte superior. Estos pueden establecerse entre 5, 15 &oacute; 30 segundos. <span class="SUBTTLO2">Por defecto estos rangos est&aacute;n apagados y s&oacute;lo se activan al seleccionar uno de ellos y luego usar los botones Detener y luego Refrescar.</span> </p>
            <p align="center"><img src="../img/OPF_009E2.PNG" width="301" height="156"></p>
            <p align="center">&nbsp;</p>
            <p align="left" class="PARRAFO">Antes de iniciar el cargue de un grupo en el d&iacute;a, el sistema los muestra con el campo <em>Estado proceso</em> en blanco. Luego &eacute;ste varia de acuerdo al estado de los Procesos ejecutados por cada Grupo.</p>
            <p align="left" class="PARRAFO"><em>Proceso en ejecuci&oacute;n:</em> El sistema est&aacute; corriendo el paquete del proceso. </p>
            <p align="left" class="PARRAFO"><em>Ejecuci&oacute;n parcial:</em> El sistema ha presentado alg&uacute;n error que puede ser consultado directamente en el log de operaciones o en el <a href="OPH_003B.html" class="LINK2">Hist&oacute;rico de procesos</a>. </p>
            <p align="left" class="PARRAFO"><em>Ejecuci&oacute;n total:</em> El proceso ha finalizado exitosamente. </p>
            <p align="left" class="PARRAFO"><em>Proceso pendiente</em> o <em>Proceso en cola: </em>El sistema identifica estos procesos como pendientes por procesar. </p>
            <p align="center">&nbsp;</p>
            <p align="left" class="PARRAFO"><span class="SUBTTLO2"><span style'font-family:Arial'><b style'mso-bidi-font-weight:normal'>Procesos<a name="Procesos"></a></b></span><font face="Arial, Helvetica, sans-serif"><span style'font-family:Arial'>:</span></font></span> Este hiperv&iacute;nculo le permite al usuario la consulta del detalle de la ejecuci&oacute;n de cada uno de los Procesos pertenecientes al Grupo seleccionado en la pantalla principal. Se usa m&aacute;s con el prop&oacute;sito de consultar un Proceso en el momento de haber presentado algun error, pues la descripci&oacute;n de &eacute;ste se muestra a nivel del campo <em>Mensaje</em>. </p>
            <p align="left" class="PARRAFO">Es importante tener en cuenta que a diferencia de la opci&oacute;n <a href="OPH_007B.html" class="LINK2">Ejecuci&oacute;n grupos independientes</a>, esta opci&oacute;n no permite la ejecuci&oacute;n de los procesos uno a uno, s&oacute;lo de todos los Grupos que  hayan sido marcados como <em>Obligatorio</em> en la opci&oacute;n <a href="OPH_001B.html" class="LINK2">Definici&oacute;n grupos de procesos</a>.</p>
            <p align="left" class="PARRAFO">Tal como aplica para la ejecuci&oacute;n de Grupos descrita arriba, esta pantalla permite la actualizaci&oacute;n a trav&eacute;s de los mismos rangos de 5, 15 &oacute; 30 segundos, y mostrando el estado de los procesos y su <em>N&uacute;mero de ejecuciones</em>. En caso de presentarse alg&uacute;n error, ser&aacute; mostrado en el campo <em>Mensaje</em> de esta misma pantalla. </p>
            <p align="center"><img src="../img/OPF_009E3.PNG" width="866" height="368"></p>
    </section>
    <script src="../js/menu.js"></script>

    <footer>
        <div>
            <img src="../img/logo.png">
        </div>
        <p>Open Card S.A.</p>
        <p>-- Calle 77 Nº 11-19 Piso 4°, Ofc. 402, Bogotá D.C.</p>
        <p> Colombia Suramérica -- Tel (571) 313 37 75- <a href="http://www.opencard.com"
                target="_blank">www.opencard.com</a></p>

    </footer>
</body>

</html>